[
    {
      "tag": "greeting",
      "patterns": [ "Hi", "Hey", "Is anyone there?", "Hello", "Hay" ],
      "responses": [ "Hello", "Hi", "Hi there" ]
    },
    {
      "tag": "bye",
      "patterns": [ "Bye", "See you later", "Goodbye", "byee", "byeee" ],
      "responses": [ "Have a nice day", "Bye! Come back again" ]
    },
    {
      "tag": "thanks",
      "patterns": [ "Thanks", "Thank you", "That's helpful", "Thanks for the help" ],
      "responses": [ "Happy to help!", "Any time!", "My pleasure", "You're most welcome!" ]
    },
     {
      "tag": "help",
      "patterns": [ "Can you help me" ],
      "responses": [ "Sure, Please tell me What do you need ?" ]
    },
    {
      "tag": "near",
      "patterns": [ "what are sweet shops near by", "sweet shop near by", "I need sweet shops near by", "where are sweet shops near me" ],
      "responses": [ "Please tell me your location" ]
    },
    {
      "tag": "Clappana_sweet",
      "patterns": [ "My location is Clappana"],
      "responses": [ "there are 2 people availble from your cluster who are selling sweets. Ravindra - 98765******, virat - 98222***** and other cluster which is near by to your location. Priya - 8765*******" ]
    },
    {
      "tag": "clappana",
      "patterns": [ "clappana"],
      "responses": [ "there are 2 people availble from your cluster who are selling pickles. Aswathy - 98885******, Mahindra - 89452*****" ]
    },
    {
      "tag": "about",
      "patterns": [ "Who are you?", "What are you?", "Who you are?" ],
      "responses": [ "I.m Advertisement informer, your bot assistant", "I'm  Advertisement informer, an Artificial Intelligent bot" ]
    },
    {
      "tag": "pickle",
      "patterns": [ "what are pickle shops near by", "pickle shop near by", "I need pickle shops near by", "where are pickle shops near me","I need pickles" ],
      "responses": [ "Please tell me your location" ]
    },
    {
      "tag": "name",
      "patterns": [ "what is your name", "what should I call you", "whats your name?" ],
      "responses": [ "You can call me Amritasree", "My name is Amritasree", "I'm  Amritasree" ]
    },
    {
      "tag": "Thiruvanathapuram",
      "patterns": [ "Is there any sweet shop at Thiruvanathapuram", "Is there any bakkery at Thiruvanathapuram", "what are the bakkery at Thiruvanathapuram", "Are there any bakery available at Thiruvanathapuram?", "What are the good sweet shops at thiruvananthapuram?", "Is there any good sweet shops?" ],
      "responses": [ "The most popular bakery/sweet shops at thiruvananthapuram are Sasthas Sweets, Maha Chips, Sri Krishna Sweets Private Limited, Pushpa Bakery " ]
    },
    {
      "tag": "Kollam",
      "patterns": [ "Is there any sweet shop at Kollam", "Is there any bakkery at Kollam", "what are the bakkery at Kollam", "Are there any bakery available at Kollam?", "What are the good sweet shops at Kollam?", "Is there any good sweet shops at Kollam?" ],
      "responses": [ "The most popular bakery/sweet shops at Kollam are Lekshmi bakers, Crown Bakers, Priya Sweet shop, AD Sweet shops " ]
    },
    {
      "tag": "Kochi",
      "patterns": [ "Is there any sweet shop at Kochi", "Is there any bakkery at Kochi", "what are the bakkery at Kochi", "Are there any bakery available at Kochi?", "What are the good sweet shops at Kochi?", "Is there any good sweet shops at Kochi?" ],
      "responses": [ "The most popular bakery/sweet shops at Kochi are  Sangam Sweets, Bharath Bakers, Miss Bakers " ]
    },

    {
      "tag": "Sasthas",
      "patterns": [ "Can i know more about Sasthas Sweets", "How is Sasthas Sweets", "Will Sasthas Sweets do bulk orders", "I need more details of Sasthas Sweets", "Will Sasthas Sweets do for bulk orders" ],
      "responses": [ "Sasthas Sweets is one of the famous food brands of Thiruvananthapuram. We do bulk orders at very less price with high quality. For more information you can contact 987******* or ***@gmail.com" ]
    },
    {
      "tag": "Maha",
      "patterns": [ "Can i know more about Maha Sweets", "How is Maha Sweets", "Will Maha Sweets do bulk orders", "I need more details of Maha Sweets", "Will Maha Sweets do for bulk orders" ],
      "responses": [ "Maha Sweets is one of the best food brands of Thiruvananthapuram. We do bulk orders at very less price with high quality. For more information you can contact 987******* or ***@gmail.com" ]
    },

    {
      "tag": "Krishna",
      "patterns": [ "Can i know more about Krishna Sweets", "How is Krishna Sweets", "Will Krishna Sweets do bulk orders", "I need more details of Krishna Sweets", "Will Krishna Sweets do for bulk orders" ],
      "responses": [ "Krishna Sweets is one of the famous food brands of Thiruvananthapuram. We do bulk orders at very less price with high quality. For more information you can contact 987******* or ***@gmail.com" ]
    },

    {
      "tag": "Lekshmi",
      "patterns": [ "Can i know more about Lekshmi Sweets", "How is Lekshmi Sweets", "Will Lekshmi Sweets do bulk orders", "I need more details of Lekshmi Sweets", "Will Lekshmi Sweets do for bulk orders" ],
      "responses": [ "Lekshmi Sweets is one of the most popular sweet shops at Kollam. Currently there is more orders pending and the bulk order takes time. For more information you can contact 987******* or ***@gmail.com" ]
    },

    {
      "tag": "Crown",
      "patterns": [ "Can i know more about Crown Sweets", "How is Crown Sweets", "Will Crown Sweets do bulk orders", "I need more details of Crown Bakers", "Will Crown Bakers do for bulk orders" ],
      "responses": [ "Crown Bakers is one of the most popular sweet shops at Kollam. Currently there is more orders pending and the bulk order takes time. For more information you can contact 987******* or ***@gmail.com" ]
    },

    {
      "tag": "Priya",
      "patterns": [ "Can i know more about Priya Sweets", "How is Priya Sweets", "Will Priya Sweets do bulk orders", "I need more details of Priya Sweets", "Will Priya Sweets do for bulk orders" ],
      "responses": [ "Priya Sweets is one of the most popular sweet shops at Kollam. Currently there is more orders pending and the bulk order takes time. For more information you can contact 987******* or ***@gmail.com" ]
    },
    {
      "tag": "Sangam",
      "patterns": [ "Can i know more about Sangam Sweets", "How is Sangam Sweets", "Will Sangam Sweets do bulk orders", "I need more details of Sangam Sweets", "Will Sangam Sweets do for bulk orders" ],
      "responses": [ "Sangam Sweets is one of the most leading shops at Kochi. We provide the best quality items in less amount of time. For more information you can contact 987******* or ***@gmail.com" ]
    },
    {
      "tag": "Bharath",
      "patterns": [ "Can i know more about Bharath Sweets", "How is Bharath Sweets", "Will Bharath Sweets do bulk orders", "I need more details of Bharath Sweets", "Will Bharath Sweets do for bulk orders" ],
      "responses": [ "Bharath Sweets is one of the most leading shops at Kochi. We provide the best quality items in less amount of time. For more information you can contact 987******* or ***@gmail.com" ]
    },

    {
      "tag": "Miss",
      "patterns": [ "Can i know more about Miss Bakers", "How is Miss Bakers shop", "Will Miss Bakers do bulk orders", "I need more details of Miss Bakers", "Will Miss Bakers do for bulk orders" ],
      "responses": [ "Miss Bakers is one of the most leading shops at Kochi. We provide the best quality items in less amount of time. For more information you can contact 987******* or ***@gmail.com" ]
    },

    {
      "tag": "cloth_thiru",
      "patterns": [ "what are famous cloth stores at thiruvanathapuram", "Are there any discounts for clothes at thiruvanathapuram", "Which is the best place to buy clothes at thiruvanathpuram", "what are famous shops to buy clothes at thiruvananthapuram" ],
      "responses": [ "Few famous cloth stores at thiruvananthapuram includes pothys, Allen solly store, Trends" ]
    },

    {
      "tag": "cloth_kochi",
      "patterns": [ "what are famous cloth stores at kochi", "Are there any discounts for clothes at kochi", "Which is the best place to buy clothes at kochi", "what are famous shops to buy clothes at kochi" ],
      "responses": [ "Few famous cloth stores at kochi includes Lulu Fashion Store Kochi, Peter England store, Aambal Eco clothing store" ]
    },

    {
      "tag": "pothys",
      "patterns": [ "Is there any discounts at pothys", "Are there any offers at pothys", "How is pothys store", "Is it worth to visit pothys?", "what good is pothys?", "Can you tell more details about pothys", "will there be extra discount for bulk orders at pothys?" ],
      "responses": [ "Pothys is one of the best clothing store at Thiruvananthapuram, Currently there is 20% discount sale for Diwali. For more details please dial ********* or contact us at ***@gmail.com" ]
    },
    {
      "tag": "Allen_solly",
      "patterns": [ "Is there any discounts at Allen solly", "Are there any offers at Allen solly", "How is Allen solly store", "Is it worth to visit Allen solly?", "what good is Allen solly?", "Can you tell more details about Allen solly", "will there be extra discount for bulk orders at Allen solly?" ],
      "responses": [ "Pothys is one of the best clothing store at Thiruvananthapuram, Currently there is 20% discount sale for Diwali. For more details please dial ********* or contact us at ***@gmail.com" ]
    },
    {
      "tag": "Trends",
      "patterns": [ "Is there any discounts at Trends", "Are there any offers at Trends", "How is Trends store", "Is it worth to visit Trends?", "what good is Trends?", "Can you tell more details about Trends", "will there be extra discount for bulk orders at Trends?" ],
      "responses": [ "Trends is one of the best clothing store at Thiruvananthapuram, Currently there is 20% discount sale for Diwali. For more details please dial ********* or contact us at ***@gmail.com" ]
    },
    {
      "tag": "Lulu",
      "patterns": [ "Is there any discounts at Lulu shoppping mall", "Are there any offers at Lulu shoppping", "How is Lulu shoppping store", "Is it worth to visit Lulu shoppping mall?", "what good is Lulu shoppping mall?", "Can you tell more details about Lulu shoppping mall", "will there be extra discount for bulk orders at Lulu shoppping mall?" ],
      "responses": [ "LULU Fashion Mall is the best place to buy clothes at Kochi, Currently there are more exiting offers for Diwali . For more details please dial ********* or contact us at ***@gmail.com" ]
    },
    {
      "tag": "Peter",
      "patterns": [ "Is there any discounts at Peter England", "Are there any offers at Peter England", "How is Peter England store", "Is it worth to visit Peter England?", "what good is Peter England?", "Can you tell more details about Peter England", "will there be extra discount for bulk orders at Peter England?" ],
      "responses": [ "Peter England is the best place to buy clothes at Kochi, Currently there are more exiting offers for Diwali . For more details please dial ********* or contact us at ***@gmail.com" ]
    },
    {
      "tag": "Aambal",
      "patterns": [ "Is there any discounts at Aambal Eco clothing", "Are there any offers at Aambal Eco clothing", "How is Aambal Eco clothing store", "Is it worth to visit Aambal Eco clothing?", "what good is Aambal Eco clothing?", "Can you tell more details about Aambal Eco clothing", "will there be extra discount for bulk orders at Aambal Eco clothing?" ],
      "responses": [ "Aambal Eco clothing is the best place to buy clothes at Kochi, Currently there are more exiting offers for Diwali . For more details please dial ********* or contact us at ***@gmail.com" ]
    }

  ]